example_xml/2_acs_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
  <soap-env:Header>
    <cwmp:ID soap-env:mustUnderstand="1">17c0fe79e0c0113</cwmp:ID>
  </soap-env:Header>
  <soap-env:Body>
    <cwmp:SetParameterValues>
      <ParameterList soap-enc:arrayType="cwmp:ParameterValueStruct[32]">
        <ParameterValueStruct>
          <Name>Device.ManagementServer.URL</Name>
	  <Value xsi:type="xsd:string">http://10.0.11.184:7547/acs</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.ManagementServer.PeriodicInformEnable</Name>
          <Value xsi:type="xsd:boolean">true</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.ManagementServer.PeriodicInformInterval</Name>
          <Value xsi:type="xsd:unsignedInt">60</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.AccessMgmt.UMTS.NonCSGUEAccessDecision</Name>
          <Value xsi:type="xsd:string">Local</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.FAPControl.UMTS.Gateway.FAPGWServer1</Name>
          <Value xsi:type="xsd:string">10.70.0.2</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.REM.UMTS.WCDMA.ScanPeriodically</Name>
          <Value xsi:type="xsd:boolean">false</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.REM.UMTS.WCDMA.ScanOnBoot</Name>
          <Value xsi:type="xsd:boolean">false</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.REM.X_000295_ExternalPaGain</Name>
          <Value xsi:type="xsd:int">0</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.CN.X_000295_IuUpInitNoDataSupported</Name>
          <Value xsi:type="xsd:boolean">true</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.CN.PSDomain.NetworkModeOperationCombined</Name>
          <Value xsi:type="xsd:boolean">true</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.CN.CSDomain.IMSIAttachDetachEnable</Name>
          <Value xsi:type="xsd:boolean">true</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.X_000295_CellBroadcastEnable</Name>
          <Value xsi:type="xsd:boolean">false</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.X_000295_HandoverEnabled</Name>
          <Value xsi:type="xsd:boolean">true</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.X_000295_IntraFrequencyHandoutEnabled</Name>
          <Value xsi:type="xsd:boolean">true</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.X_000295_PSHandoverEnabled</Name>
          <Value xsi:type="xsd:boolean">true</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.X_000295_DataOnFACHEnable</Name>
          <Value xsi:type="xsd:boolean">true</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.X_000295_FdEnabled</Name>
          <Value xsi:type="xsd:boolean">false</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.1.X_000295_TxDiversityIndicator</Name>
          <Value xsi:type="xsd:unsignedInt">1</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.1.PLMNID</Name>
          <Value xsi:type="xsd:string">00101</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.1.CID</Name>
          <Value xsi:type="xsd:unsignedInt">210</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.1.UARFCNDL</Name>
          <Value xsi:type="xsd:unsignedInt">1007</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.1.LAC</Name>
          <Value xsi:type="xsd:unsignedInt">64000</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.1.RAC</Name>
          <Value xsi:type="xsd:unsignedInt">210</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.1.RNCID</Name>
          <Value xsi:type="xsd:unsignedInt">210</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.1.PCPICHScramblingCode</Name>
          <Value xsi:type="xsd:unsignedInt">123</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.2.PLMNID</Name>
          <Value xsi:type="xsd:string">25001</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.2.X_000295_TxDiversityIndicator</Name>
          <Value xsi:type="xsd:unsignedInt">1</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.2.PCPICHScramblingCode</Name>
          <Value xsi:type="xsd:unsignedInt">123</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.2.RAC</Name>
          <Value xsi:type="xsd:unsignedInt">210</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.2.LAC</Name>
          <Value xsi:type="xsd:unsignedInt">64000</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.2.UARFCNDL</Name>
          <Value xsi:type="xsd:unsignedInt">10753</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.Services.FAPService.1.CellConfig.UMTS.RAN.NeighborList.InterFreqCell.2.CID</Name>
          <Value xsi:type="xsd:unsignedInt">10</Value>
        </ParameterValueStruct>
      </ParameterList>
      <ParameterKey/>
    </cwmp:SetParameterValues>
  </soap-env:Body>
</soap-env:Envelope>
